# author:jaychan
# date:2018/10/11
# version: 0.1
# desc: oop

#面向对象编程
    # 基础
    # 公有私有
    # 继承
    # 组合，Minxi
#魔法函数
    #魔法函数概述
    #构造类魔法函数
    #运算类魔法函数
# OOP思想
    #1接触到任意一个任务，首先想到的是任务这个世界的构成，是由模型构成的
    #OO面向对象
    #OOA面向对象分析
    #OOD面向对象设计
    #OOIXXX的实现
    #OOPXXX的编程
    #过程： OOA->OOD->OOI 面向对象的实现过程
    #类:抽象名词，代表一个集合，共性的事物
    #对象:巨像的事物，单个个体
    #类和对象的关系
        #一个具象，代表一类事物的某一个个体
        #一个是抽象，代表的是一大类事物
    #类中的内容，应该具有两个内容
        #表明事物的特征，叫做属性(变量)
        #表明事物功能或动作，称为成员方法（函数）
    #类的基本实现
        #类的命名
            #遵守变量命名的规范
            #大驼峰
            #尽量避开跟系统命名相似的命名
